app/views/articles/_article_form.html.erb

SELECT "categories".* FROM "categories"
---

<%= f.select :category_id, Category.all.map {|c| [c.category, c.id]} %>