app/views/articles/index.html.erb

                <span class="badge badge-primary badge-pill">
                  <%= article.likes.count %> likes!
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."article_id" = ?  [["article_id", 6]]