app/views/articles/index.html.erb

            <strong class="d-inline-block mb-2 text-success"><%= category.category %></strong>
            <h3 class="mb-0"><%= category.articles.last.title %></h3>
            <div class="mb-1 text-muted"><%= category.articles.last.created_at.strftime("%Y/%m/%d") %></div>
            <p class="mb-auto">
            <p class="card-text"><%= truncate(category.articles.last.content, length: 100) %></p>
            <%= link_to 'Read more', article_path(category.articles.last), class: 'stretched-link' %>
---
SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = ? ORDER BY "articles"."id" DESC LIMIT ?  [["category_id", 1], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]
SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 3]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."category_id" = ?  [["category_id", 1]]
SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC

          <%= like_or_dislike_btn(article) %>
          <%= article.likes.count %>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."article_id" = ?  [["article_id", 13]]

                  <span class="badge badge-primary badge-pill">
                    <%= category.articles.count %>
---
SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = ? ORDER BY "articles"."id" ASC LIMIT ? OFFSET ?  [["category_id", 1], ["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."category_id" = ?  [["category_id", 1]]