app/views/shared/_featured.html.erb

SELECT "categories".* FROM "categories"
---
<div class="card-group">
  <% Category.all.each do |category|%>

SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = ? ORDER BY "articles"."id" DESC LIMIT ?  [["category_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "articles"
SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = ? ORDER BY "articles"."id" DESC LIMIT ?  [["category_id", 7], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <div class="card mb-2">
        <%= image_tag category.articles.last.image, class: "card-img-top" unless category.articles.last.nil? %>
        <div class="card-img-overlay font-weight-bold">
          <h5 class="card-title bg-info text-light d-table"><%= category.articles.last.title unless category.articles.last.nil? %></h5>
          <p class="card-text bg-dark text-light"><%= truncate(category.articles.last.content, length: 100) unless category.articles.last.nil? %></p>
          <p class="card-text"><small class="bg-secondary text-white"><%= category.articles.last.created_at.strftime("%Y/%m/%d") unless category.articles.last.nil?%></small></p>
          <p><small class="text-muted bg-white">by <%= category.articles.last.user.name unless category.articles.last.nil? %></small></p>