app/helpers/application_helper.rb

SELECT "likes".* FROM "likes" WHERE "likes"."article_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["article_id", 11], ["user_id", 1], ["LIMIT", 1]]
---
  def like_or_dislike_btn(article)
    like = Like.find_by(article: article, user: current_user)