app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = ? LIMIT ? OFFSET ?  [["category_id", 1], ["LIMIT", 3], ["OFFSET", 0]]
---
  def index
    @categories = Category.all
    cate = params[:cate]
    @articles =  if !cate.nil?
                    Article.where(category_id: cate).includes([:user]).paginate(page: params[:page], per_page: 3)