app/controllers/articles_controller.rb

  def index
    @categories = Category.all
    cate = params[:cate]
    if !cate.nil?
      @articles = Article.where(:category_id => cate)
    else
      @articles = Article.order(created_at: :desc).includes(:user).paginate(page: params[:page], per_page: 3)
---
SELECT "categories".* FROM "categories"
SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = ?  [["category_id", 1]]
SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."category_id" = ?  [["category_id", 1]]

  def create
    @article = current_user.articles.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "content", "image", "created_at", "updated_at", "category_id", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Why do we use it?"], ["updated_at", "2020-10-13 10:55:09.327898"], ["id", 5]]