app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
---
  def index
    @categories = Category.all.paginate(page: params[:page], per_page: 30)

INSERT INTO "categories" ("category", "created_at", "updated_at") VALUES (?, ?, ?)  [["category", "Games"], ["created_at", "2020-10-12 15:04:24.390788"], ["updated_at", "2020-10-12 15:04:24.390788"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save

UPDATE "categories" SET "category" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["category", "Category 2555"], ["updated_at", "2020-10-12 13:50:14.072262"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @category.update(category_params)

DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 2]]
---
  def destroy
    @category.destroy