app/controllers/likes_controller.rb

INSERT INTO "likes" ("article_id", "user_id") VALUES ($1, $2) RETURNING "id"  [["article_id", 10], ["user_id", 1]]
---
  def create
    @like = current_user.likes.new(article_id: params[:article_id])
    if @like.save

SELECT "likes".* FROM "likes" WHERE "likes"."id" = ? AND "likes"."user_id" = ? AND "likes"."article_id" = ? LIMIT ?  [["id", 1], ["user_id", 1], ["article_id", 10], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
---
  def destroy
    like = Like.find_by(id: params[:id], user: current_user, article_id: params[:article_id])
    if like
      like.destroy